class Snake {
    constructor() {
        //инициализация змейки
        //размер (сколько клеток изначально занимает змейка),цвет
        //начальное позиционирование и другие параметры
    }

    death() {
        //логика поражения змейки
    }

    update() {
        //логика именно обновления змейки
        //при каких условиях необходимо меняться
    }
    draw() {
        //Логика отрисовки змейки
    }

    control() {
        //логика управления змейкой
        //обработка кнопок на клавиатуре
    }
}

export default Snake;
